backend/perf/presign-status.yml
config:
  target: "{{ $processEnvironment.API_BASE_URL }}"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      name: "Sustained load"
  plugins:
    expect: {}
  processor: "./processor.js"
  variables:
    jobId: "test-job-{{ $randomString() }}"

scenarios:
  - name: "Presign upload - single file"
    weight: 50
    flow:
      - post:
          url: "/v1/upload/presign"
          headers:
            Content-Type: "application/json"
          json:
            fileName: "test-image-{{ $randomNumber(1, 10000) }}.jpg"
            fileSize: 1048576
            mimeType: "image/jpeg"
            prompt: "Make it vibrant"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: uploadUrl
            - hasProperty: jobId
          capture:
            - json: "$.jobId"
              as: "capturedJobId"

  - name: "Presign upload - batch files"
    weight: 30
    flow:
      - post:
          url: "/v1/upload/presign"
          headers:
            Content-Type: "application/json"
          json:
            files:
              - fileName: "batch-1-{{ $randomNumber(1, 10000) }}.jpg"
                fileSize: 1048576
                mimeType: "image/jpeg"
              - fileName: "batch-2-{{ $randomNumber(1, 10000) }}.jpg"
                fileSize: 2097152
                mimeType: "image/jpeg"
              - fileName: "batch-3-{{ $randomNumber(1, 10000) }}.jpg"
                fileSize: 1572864
                mimeType: "image/jpeg"
            sharedPrompt: "Enhance colors"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: batchJobId
            - hasProperty: uploads

  - name: "Check job status"
    weight: 20
    flow:
      - get:
          url: "/v1/jobs/{{ jobId }}"
          expect:
            - statusCode: [200, 404]
            - contentType: json